# a.	создайте функцию task_1(), в теле функции:
# i.	создайте 5 разных переменных с произвольным названием.
# ii.	у каждой укажите тип, типы следующие
# 1.	int, float, str, list, bool
# iii.	заполните переменные произвольными значениями, с соответствующим для каждой типом
# iv.	выведите тип данных каждой в консоль.
# b.	в функцию добавьте аннотацию возвращаемых данных
# c.	добавьте вызов функции.




# def task_1():
#     return (1, 2.3,'afisha', [1, 2, 4], )
# print(task_1(1))


# 4.	задача 2
# a.	создайте функцию task_2(), в теле функции:
# i.	есть список a = [1, 2, 3, 5, 8, 13, 21]
# ii.	выведите в консоль первые 3 значения списка
# b.	в функцию добавьте аннотацию возвращаемых данных
# c.	добавьте вызов функции.
# d.	* - скажите как называется эта последовательность чисел

# def task_2([1w, 2, 3, 5 , 8, 15, 21])
#     return ([0:2])


A = [1, 2, 3, 5, 8, 15, 21]
def task_2(а):
    return (a
            )
print(task_2(a[1:3]))
